dashboard-dir/app/Models/BlogModel.php

SELECT `blogs`.*, `blog_categories`.`category_name`
FROM `blogs`
LEFT JOIN `blog_categories` ON `blog_categories`.`category_id` = `blogs`.`category_id`
---
    public function getBlogsWithCategory()
    {
        return $this->select('blogs.*, blog_categories.category_name')
                   ->join('blog_categories', 'blog_categories.category_id = blogs.category_id', 'left')
                   ->findAll();