dashboard-dir/app/Models/BookingModel.php

    public function getBookingsWithDetails()
    {
        return $this->select('bookings.*, users.full_name, boats.boat_name, schedules.departure_date')
                   ->join('users', 'users.user_id = bookings.user_id')
                   ->join('schedules', 'schedules.schedule_id = bookings.schedule_id')
                   ->join('boats', 'boats.boat_id = schedules.boat_id')
                   ->orderBy('bookings.created_at', 'DESC')
                   ->findAll();
---
SELECT `bookings`.*, `users`.`full_name`, `boats`.`boat_name`, `schedules`.`departure_date`
FROM `bookings`
JOIN `users` ON `users`.`user_id` = `bookings`.`user_id`
JOIN `schedules` ON `schedules`.`schedule_id` = `bookings`.`schedule_id`
JOIN `boats` ON `boats`.`boat_id` = `schedules`.`boat_id`
ORDER BY `bookings`.`created_at` DESC