dashboard-dir/app/Models/OpenTripModel.php

    public function getOpenTripsWithDetails($status = null)
    {
        $builder = $this->select('open_trip_schedules.*,
                                request_open_trips.user_id as requester_id,
                                users.full_name as requester_name,
                                schedules.departure_date, schedules.departure_time,
                                boats.boat_name, boats.capacity,
                                departure.island_name as departure_island,
                                arrival.island_name as arrival_island')
                       ->join('request_open_trips', 'request_open_trips.request_id = open_trip_schedules.request_id')
                       ->join('users', 'users.user_id = request_open_trips.user_id')
                       ->join('schedules', 'schedules.schedule_id = open_trip_schedules.schedule_id')
                       ->join('boats', 'boats.boat_id = schedules.boat_id')
                       ->join('routes', 'routes.route_id = schedules.route_id')
                       ->join('islands as departure', 'departure.island_id = routes.departure_island_id')
                       ->join('islands as arrival', 'arrival.island_id = routes.arrival_island_id');

        if ($status) {
            $builder->where('open_trip_schedules.status', $status);
        }

        return $builder->orderBy('schedules.departure_date', 'ASC')
                      ->orderBy('schedules.departure_time', 'ASC')
                      ->findAll();
---
SELECT `open_trip_schedules`.*, `request_open_trips`.`user_id` as `requester_id`, `users`.`full_name` as `requester_name`, `schedules`.`departure_date`, `schedules`.`departure_time`, `boats`.`boat_name`, `boats`.`capacity`, `departure`.`island_name` as `departure_island`, `arrival`.`island_name` as `arrival_island`
FROM `open_trip_schedules`
JOIN `request_open_trips` ON `request_open_trips`.`request_id` = `open_trip_schedules`.`request_id`
JOIN `users` ON `users`.`user_id` = `request_open_trips`.`user_id`
JOIN `schedules` ON `schedules`.`schedule_id` = `open_trip_schedules`.`schedule_id`
JOIN `boats` ON `boats`.`boat_id` = `schedules`.`boat_id`
JOIN `routes` ON `routes`.`route_id` = `schedules`.`route_id`
JOIN `islands` as `departure` ON `departure`.`island_id` = `routes`.`departure_island_id`
JOIN `islands` as `arrival` ON `arrival`.`island_id` = `routes`.`arrival_island_id`
ORDER BY `schedules`.`departure_date` ASC, `schedules`.`departure_time` ASC