dashboard-dir/app/Models/RequestOpenTripModel.php

SELECT `r`.*, `b`.`boat_name`, `di`.`island_name` as `departure_island`, `ai`.`island_name` as `arrival_island`, `u`.`full_name` as `requester_name`
FROM `request_open_trips` `r`
JOIN `boats` `b` ON `b`.`boat_id` = `r`.`boat_id`
JOIN `routes` `rt` ON `rt`.`route_id` = `r`.`route_id`
JOIN `islands` `di` ON `di`.`island_id` = `rt`.`departure_island_id`
JOIN `islands` `ai` ON `ai`.`island_id` = `rt`.`arrival_island_id`
JOIN `users` `u` ON `u`.`user_id` = `r`.`user_id`
WHERE `r`.`status` = 'pending'
---
public function getPendingRequests()
{
    return $this->db->table('request_open_trips r')
        ->select('r.*, b.boat_name, di.island_name as departure_island, ai.island_name as arrival_island, u.full_name as requester_name')
        ->join('boats b', 'b.boat_id = r.boat_id')
        ->join('routes rt', 'rt.route_id = r.route_id')
        ->join('islands di', 'di.island_id = rt.departure_island_id')
        ->join('islands ai', 'ai.island_id = rt.arrival_island_id')
        ->join('users u', 'u.user_id = r.user_id')
        ->where('r.status', 'pending')
        ->get()
        ->getResultArray();