dashboard-dir/app/Models/RouteModel.php

SELECT `routes`.*, `departure`.`island_name` as `departure_island`, `arrival`.`island_name` as `arrival_island`
FROM `routes`
JOIN `islands` as `departure` ON `departure`.`island_id` = `routes`.`departure_island_id`
JOIN `islands` as `arrival` ON `arrival`.`island_id` = `routes`.`arrival_island_id`
ORDER BY `departure`.`island_name` ASC, `arrival`.`island_name` ASC
---
    public function getRoutesWithIslands()
    {
        return $this->select('routes.*,
                            departure.island_name as departure_island,
                            arrival.island_name as arrival_island')
                   ->join('islands as departure', 'departure.island_id = routes.departure_island_id')
                   ->join('islands as arrival', 'arrival.island_id = routes.arrival_island_id')
                   ->orderBy('departure.island_name', 'ASC')
                   ->orderBy('arrival.island_name', 'ASC')
                   ->findAll();