home/app/Controllers/Boats.php

SELECT *
FROM `boats`
SELECT *
FROM `islands`
---
    public function index()
    {
        $model = new BoatModel();
        $islandModel = new IslandModel();

        $data = [
            'title' => 'Pesan Kapal - Raja Ampat Boat Services',
            'boats' => $model->findAll(),
            'islands' => $islandModel->findAll()

SELECT *
FROM `boats`
WHERE `boats`.`boat_id` = '10'
---
public function openTripRequest()
{
    if (!$this->request->isAJAX()) {
        return $this->response->setStatusCode(403)->setJSON(['error' => 'Forbidden']);
    }

    if (!$this->session->get('isLoggedIn')) {
        return $this->response->setStatusCode(401)->setJSON(['error' => 'Unauthorized']);
    }

    $validation = \Config\Services::validation();
    $validation->setRules([
        'boat_id' => 'required|numeric',
        'route_id' => 'required|numeric',
        'proposed_date' => 'required|valid_date',
        'proposed_time' => 'required',
        'notes' => 'permit_empty'
    ]);

    if (!$validation->withRequest($this->request)->run()) {
        return $this->response->setStatusCode(400)->setJSON(['errors' => $validation->getErrors()]);
    }

    $requestModel = new \App\Models\RequestOpenTripsModel();
    $boatModel = new BoatModel();

    // Dapatkan kapasitas kapal
    $boatId = $this->request->getPost('boat_id');
    $boat = $boatModel->find($boatId);

SELECT *
FROM `boats`
---
public function openTripSchedule()
{
    $routeModel = new \App\Models\RouteModel(); // Add full namespace
    $modelBoat = new BoatModel();
    $model = new \App\Models\OpenTripSchedulesModel();
    $data = [
        'title' => 'Open Trip - Raja Ampat Boat Services',
        'openTrips' => $model->getUpcomingOpenTrips(),
        'boats' => $modelBoat->findAll(),

SELECT *
FROM `boats`
---
public function openTripRequests()
{
    if (!$this->session->get('isLoggedIn')) {
        return redirect()->to('/login');
    }

    $requestModel = new \App\Models\RequestOpenTripsModel();
    $boatModel = new BoatModel();
    $routeModel = new RouteModel();
    $data = [
        'title' => 'My Open Trip Requests - Raja Ampat Boat Services',
        'requests' => $requestModel->getUserRequests($_SESSION['userData']['user_id']),
        'boats' => $boatModel->findAll(),

SELECT `bookings`.*, `users`.`full_name`, `users`.`email`, `users`.`phone`, COUNT(passengers.passenger_id) as actual_passenger_count
FROM `bookings`
LEFT JOIN `users` ON `users`.`user_id` = `bookings`.`user_id`
LEFT JOIN `passengers` ON `passengers`.`booking_id` = `bookings`.`booking_id`
WHERE `bookings`.`open_trip_id` = '20'
GROUP BY `bookings`.`booking_id`
ORDER BY `bookings`.`created_at` DESC
---
public function manageOpenTripMembers($openTripId)
{
    if (!$this->session->get('isLoggedIn')) {
        return redirect()->to('/login');
    }

    $openTripModel = new \App\Models\OpenTripSchedulesModel();
    $bookingModel = new \App\Models\BookingModel();
    $db = \Config\Database::connect();

    // Get trip information
    $tripInfo = $openTripModel->getOpenTripDetails($openTripId);

    if (!$tripInfo) {
        return redirect()->back()->with('error', 'Open trip not found');
    }

    // Get members for this open trip menggunakan Query Builder
    $builder = $db->table('bookings');
    $builder->select('bookings.*,
                     users.full_name,
                     users.email,
                     users.phone,
                     COUNT(passengers.passenger_id) as actual_passenger_count'); // Ubah alias untuk menghindari konflik
    $builder->join('users', 'users.user_id = bookings.user_id', 'left');
    $builder->join('passengers', 'passengers.booking_id = bookings.booking_id', 'left');
    $builder->where('bookings.open_trip_id', $openTripId);
    $builder->groupBy('bookings.booking_id');
    $builder->orderBy('bookings.created_at', 'DESC');

    $members = $builder->get()->getResultArray();

SELECT *
FROM `open_trip_schedules`
WHERE `request_id` = '12'
 LIMIT 1
---
public function getOpenTripId()
{
    if (!$this->request->isAJAX()) {
        return $this->response->setStatusCode(403)->setJSON(['error' => 'Forbidden']);
    }

    $requestId = $this->request->getGet('request_id');
    $openTripModel = new \App\Models\OpenTripSchedulesModel();

    $openTrip = $openTripModel->where('request_id', $requestId)->first();

SELECT `boats`.`capacity`
FROM `open_trip_schedules`
JOIN `schedules` ON `schedules`.`schedule_id` = `open_trip_schedules`.`schedule_id`
JOIN `boats` ON `boats`.`boat_id` = `schedules`.`boat_id`
WHERE `open_trip_schedules`.`open_trip_id` = '20'
 LIMIT 1
SELECT SUM(`passenger_count`) AS `passenger_count`
FROM `bookings`
WHERE `open_trip_id` = '20'
 LIMIT 1
---
public function getCapacityInfo($openTripId)
{
    $openTripModel = new \App\Models\OpenTripSchedulesModel();
    $bookingModel = new \App\Models\BookingModel();

    $openTrip = $openTripModel->select('boats.capacity')
                             ->join('schedules', 'schedules.schedule_id = open_trip_schedules.schedule_id')
                             ->join('boats', 'boats.boat_id = schedules.boat_id')
                             ->where('open_trip_schedules.open_trip_id', $openTripId)
                             ->first();

    if (!$openTrip) {
        return false;
    }

    $totalBookedResult = $bookingModel->where('open_trip_id', $openTripId)
                                    ->selectSum('passenger_count')
                                    ->first();