home/app/Controllers/Gallery.php

    public function index()
    {
        $categories = ['kapal', 'wisata', 'penumpang', 'pulau'];
        $allGallery = $this->galleryModel->getAllGallery();

        // Group gallery by category
        $galleryByCategory = [];
        foreach ($categories as $category) {
            $galleryByCategory[$category] = $this->galleryModel->where('category', $category)->findAll();
        }

        $data = [
            'title' => 'Galeri - Raja Ampat Boat Services',
            'allGallery' => $allGallery,
            'galleryByCategory' => $galleryByCategory,
            'categories' => $categories,
            'featuredGallery' => $this->galleryModel->where('is_featured', 1)->findAll(12)
---
SELECT *
FROM `gallery`
WHERE `category` = 'kapal'
SELECT *
FROM `gallery`
WHERE `is_featured` = 1
 LIMIT 12