home/app/Controllers/Home.php

public function index()
{
    // Load models
    $sliderModel = new SliderModel();
    $islandModel = new IslandModel();
    $featureModel = new FeatureModel();
    $testimonialModel = new TestimonialModel();
    $scheduleModel = new ScheduleModel();
    $routeModel = new RouteModel();

    // Get data from database
    $data = [
        'title' => 'Pemesanan Kapal Raja Ampat',
        'active' => 'home',
        'sliders' => $sliderModel->where('is_active', 1)->findAll(),
        'islands' => $islandModel->findAll(),
        'features' => $featureModel->where('is_active', 1)->findAll(),
        'popularRoutes' => $routeModel->getPopularRoutes(6),
        'testimonials' => $testimonialModel->where('status', 'approved')->orderBy('created_at', 'DESC')->findAll(3),
---
SELECT *
FROM `sliders`
WHERE `is_active` = 1
SELECT *
FROM `islands`
SELECT *
FROM `features`
WHERE `is_active` = 1
SELECT *
FROM `testimonials`
WHERE `status` = 'approved'
ORDER BY `created_at` DESC
 LIMIT 3