home/app/Models/BlogCategoryModel.php

    public function getCategoriesWithCount()
    {
        $builder = $this->db->table('blog_categories c');
        $builder->select('c.*, COUNT(b.blog_id) as post_count');
        $builder->join('blogs b', 'c.category_id = b.category_id AND b.status = "published"', 'left');
        $builder->groupBy('c.category_id');
        $builder->orderBy('c.category_name', 'ASC');

        return $builder->get()->getResultArray();
---
SELECT `c`.*, COUNT(b.blog_id) as post_count
FROM `blog_categories` `c`
LEFT JOIN `blogs` `b` ON `c`.`category_id` = `b`.`category_id` AND `b`.`status` = "published"
GROUP BY `c`.`category_id`
ORDER BY `c`.`category_name` ASC