home/app/Models/BlogModel.php

SELECT `b`.*, `c`.`category_name`, `c`.`slug` as `category_slug`, `u`.`full_name` as `author_name`
FROM `blogs` `b`
LEFT JOIN `blog_categories` `c` ON `b`.`category_id` = `c`.`category_id`
LEFT JOIN `users` `u` ON `b`.`author_id` = `u`.`user_id`
WHERE `b`.`status` = 'published'
AND `b`.`published_at` <= '2025-09-12 04:14:16'
ORDER BY `b`.`published_at` DESC
 LIMIT 9
---
    public function getPublishedBlogs($limit = null, $offset = 0)
    {
        $builder = $this->db->table('blogs b');
        $builder->select('b.*, c.category_name, c.slug as category_slug, u.full_name as author_name');
        $builder->join('blog_categories c', 'b.category_id = c.category_id', 'left');
        $builder->join('users u', 'b.author_id = u.user_id', 'left');
        $builder->where('b.status', 'published');
        $builder->where('b.published_at <=', date('Y-m-d H:i:s'));
        $builder->orderBy('b.published_at', 'DESC');

        if ($limit) {
            $builder->limit($limit, $offset);
        }

        return $builder->get()->getResultArray();

SELECT `b`.*, `c`.`category_name`, `c`.`slug` as `category_slug`, `u`.`full_name` as `author_name`
FROM `blogs` `b`
LEFT JOIN `blog_categories` `c` ON `b`.`category_id` = `c`.`category_id`
LEFT JOIN `users` `u` ON `b`.`author_id` = `u`.`user_id`
WHERE `b`.`slug` = 'tarian-tradisional-masyarakat-raja-ampat'
AND `b`.`status` = 'published'
AND `b`.`published_at` <= '2025-09-12 01:07:19'
---
    public function getBlogBySlug($slug)
    {
        $builder = $this->db->table('blogs b');
        $builder->select('b.*, c.category_name, c.slug as category_slug, u.full_name as author_name');
        $builder->join('blog_categories c', 'b.category_id = c.category_id', 'left');
        $builder->join('users u', 'b.author_id = u.user_id', 'left');
        $builder->where('b.slug', $slug);
        $builder->where('b.status', 'published');
        $builder->where('b.published_at <=', date('Y-m-d H:i:s'));

        return $builder->get()->getRowArray();

SELECT `b`.*, `c`.`category_name`, `c`.`slug` as `category_slug`, `u`.`full_name` as `author_name`
FROM `blogs` `b`
LEFT JOIN `blog_categories` `c` ON `b`.`category_id` = `c`.`category_id`
LEFT JOIN `users` `u` ON `b`.`author_id` = `u`.`user_id`
WHERE `b`.`category_id` = '15'
AND `b`.`status` = 'published'
AND `b`.`published_at` <= '2025-09-12 01:07:19'
ORDER BY `b`.`published_at` DESC
 LIMIT 2
---
    public function getBlogsByCategory($category_id, $limit = null, $offset = 0)
    {
        $builder = $this->db->table('blogs b');
        $builder->select('b.*, c.category_name, c.slug as category_slug, u.full_name as author_name');
        $builder->join('blog_categories c', 'b.category_id = c.category_id', 'left');
        $builder->join('users u', 'b.author_id = u.user_id', 'left');
        $builder->where('b.category_id', $category_id);
        $builder->where('b.status', 'published');
        $builder->where('b.published_at <=', date('Y-m-d H:i:s'));
        $builder->orderBy('b.published_at', 'DESC');

        if ($limit) {
            $builder->limit($limit, $offset);
        }

        return $builder->get()->getResultArray();

SELECT `b`.*, `c`.`category_name`, `u`.`full_name` as `author_name`
FROM `blogs` `b`
LEFT JOIN `blog_categories` `c` ON `b`.`category_id` = `c`.`category_id`
LEFT JOIN `users` `u` ON `b`.`author_id` = `u`.`user_id`
WHERE `b`.`status` = 'published'
AND `b`.`published_at` <= '2025-09-12 01:07:19'
ORDER BY `b`.`published_at` DESC
 LIMIT 5
---
    public function getRecentPosts($limit = 5)
    {
        $builder = $this->db->table('blogs b');
        $builder->select('b.*, c.category_name, u.full_name as author_name');
        $builder->join('blog_categories c', 'b.category_id = c.category_id', 'left');
        $builder->join('users u', 'b.author_id = u.user_id', 'left');
        $builder->where('b.status', 'published');
        $builder->where('b.published_at <=', date('Y-m-d H:i:s'));
        $builder->orderBy('b.published_at', 'DESC');
        $builder->limit($limit);

        return $builder->get()->getResultArray();