home/app/Models/GalleryModel.php

SELECT *
FROM `gallery`
ORDER BY `created_at` DESC
---
    public function getAllGallery($limit = null)
    {
        $builder = $this->db->table('gallery');
        $builder->orderBy('created_at', 'DESC');

        if ($limit) {
            $builder->limit($limit);
        }

        return $builder->get()->getResultArray();