home/app/Models/OpenTripSchedulesModel.php

SELECT `open_trip_schedules`.*, `schedules`.*, `boats`.`boat_name`, `boats`.`capacity`, `boats`.`price_per_trip`, `departure`.`island_name` as `departure_island`, `arrival`.`island_name` as `arrival_island`, `request_open_trips`.`user_id` as `trip_owner_id`, `users`.`full_name` as `trip_owner_name`, `users`.`phone` as `trip_owner_phone`
FROM `open_trip_schedules`
JOIN `schedules` ON `schedules`.`schedule_id` = `open_trip_schedules`.`schedule_id`
JOIN `boats` ON `boats`.`boat_id` = `schedules`.`boat_id`
JOIN `routes` ON `routes`.`route_id` = `schedules`.`route_id`
JOIN `islands` `departure` ON `departure`.`island_id` = `routes`.`departure_island_id`
JOIN `islands` `arrival` ON `arrival`.`island_id` = `routes`.`arrival_island_id`
LEFT JOIN `request_open_trips` ON `request_open_trips`.`request_id` = `open_trip_schedules`.`request_id`
LEFT JOIN `users` ON `users`.`user_id` = `request_open_trips`.`user_id`
WHERE `open_trip_schedules`.`open_trip_id` = '20'
 LIMIT 1
---
 public function getOpenTripDetails($openTripId)
    {
        return $this->select('open_trip_schedules.*,
                            schedules.*,
                            boats.boat_name,
                            boats.capacity,
                            boats.price_per_trip,
                            departure.island_name as departure_island,
                            arrival.island_name as arrival_island,
                            request_open_trips.user_id as trip_owner_id,
                            users.full_name as trip_owner_name,
                            users.phone as trip_owner_phone')
                   ->join('schedules', 'schedules.schedule_id = open_trip_schedules.schedule_id')
                   ->join('boats', 'boats.boat_id = schedules.boat_id')
                   ->join('routes', 'routes.route_id = schedules.route_id')
                   ->join('islands departure', 'departure.island_id = routes.departure_island_id')
                   ->join('islands arrival', 'arrival.island_id = routes.arrival_island_id')
                   ->join('request_open_trips', 'request_open_trips.request_id = open_trip_schedules.request_id', 'left')
                   ->join('users', 'users.user_id = request_open_trips.user_id', 'left')
                   ->where('open_trip_schedules.open_trip_id', $openTripId)
                   ->first();