home/app/Models/RequestOpenTripsModel.php

SELECT `request_open_trips`.*, `boats`.`boat_name`, `boats`.`boat_type`, `departure`.`island_name` as `departure_island_name`, `arrival`.`island_name` as `arrival_island_name`
FROM `request_open_trips`
JOIN `boats` ON `boats`.`boat_id` = `request_open_trips`.`boat_id`
JOIN `routes` ON `routes`.`route_id` = `request_open_trips`.`route_id`
JOIN `islands` `departure` ON `departure`.`island_id` = `routes`.`departure_island_id`
JOIN `islands` `arrival` ON `arrival`.`island_id` = `routes`.`arrival_island_id`
WHERE `request_open_trips`.`user_id` = '18'
ORDER BY `request_open_trips`.`proposed_date` DESC
---
    public function getUserRequests($userId)
{
    return $this->select('request_open_trips.*,
                        boats.boat_name, boats.boat_type,
                        departure.island_name as departure_island_name,
                        arrival.island_name as arrival_island_name')
               ->join('boats', 'boats.boat_id = request_open_trips.boat_id')
               ->join('routes', 'routes.route_id = request_open_trips.route_id')
               ->join('islands departure', 'departure.island_id = routes.departure_island_id')
               ->join('islands arrival', 'arrival.island_id = routes.arrival_island_id')
               ->where('request_open_trips.user_id', $userId)
               ->orderBy('request_open_trips.proposed_date', 'DESC')
               ->findAll();