home/app/Models/RouteModel.php

SELECT `routes`.*, `departure`.`island_name` as `departure_island_name`, `departure`.`slug` as `departure_slug`, `arrival`.`island_name` as `arrival_island_name`, `arrival`.`slug` as `arrival_slug`
FROM `routes`
JOIN `islands` `departure` ON `departure`.`island_id` = `routes`.`departure_island_id`
JOIN `islands` `arrival` ON `arrival`.`island_id` = `routes`.`arrival_island_id`
ORDER BY `departure`.`island_name`, `arrival`.`island_name`
---
    public function getRoutesWithIslands()
    {
        return $this->select('routes.*,
                            departure.island_name as departure_island_name,
                            departure.slug as departure_slug,
                            arrival.island_name as arrival_island_name,
                            arrival.slug as arrival_slug')
                   ->join('islands departure', 'departure.island_id = routes.departure_island_id')
                   ->join('islands arrival', 'arrival.island_id = routes.arrival_island_id')
                   ->orderBy('departure.island_name')
                   ->orderBy('arrival.island_name')
                   ->findAll();

SELECT `r`.`route_id`, `r`.`estimated_duration`, `r`.`distance`, `dep`.`island_name` as `departure_island`, `arr`.`island_name` as `arrival_island`, COUNT(s.schedule_id) as schedule_count
FROM `routes` `r`
JOIN `islands` `dep` ON `r`.`departure_island_id` = `dep`.`island_id`
JOIN `islands` `arr` ON `r`.`arrival_island_id` = `arr`.`island_id`
LEFT JOIN `schedules` `s` ON `r`.`route_id` = `s`.`route_id`
WHERE `s`.`status` = 'available'
AND `s`.`departure_date` >= '2025-08-28'
GROUP BY `r`.`route_id`
ORDER BY `schedule_count` DESC, `dep`.`island_name`, `arr`.`island_name`
 LIMIT 6
---
    public function getPopularRoutes($limit = 10)
    {
        $builder = $this->db->table('routes r');
        $builder->select('
            r.route_id,
            r.estimated_duration,
            r.distance,
            dep.island_name as departure_island,
            arr.island_name as arrival_island,
            COUNT(s.schedule_id) as schedule_count
        ');

        $builder->join('islands dep', 'r.departure_island_id = dep.island_id');
        $builder->join('islands arr', 'r.arrival_island_id = arr.island_id');
        $builder->join('schedules s', 'r.route_id = s.route_id', 'left');

        $builder->where('s.status', 'available');
        $builder->where('s.departure_date >=', date('Y-m-d'));

        $builder->groupBy('r.route_id');
        $builder->orderBy('schedule_count', 'DESC');
        $builder->orderBy('dep.island_name');
        $builder->orderBy('arr.island_name');
        $builder->limit($limit);

        return $builder->get()->getResultArray();