home/app/Models/ScheduleModel.php

    public function getScheduleWithDetails($scheduleId)
    {
        $builder = $this->db->table('schedules s');
        $builder->select('
            s.*,
            b.boat_name,
            b.boat_type,
            b.capacity,
            b.price_per_trip,
            b.image_url,
            b.facilities,
            b.is_featured,
            r.route_id,
            r.estimated_duration,
            r.distance,
            dep.island_name as departure_island,
            arr.island_name as arrival_island
        ');

        $builder->join('boats b', 's.boat_id = b.boat_id');
        $builder->join('routes r', 's.route_id = r.route_id');
        $builder->join('islands dep', 'r.departure_island_id = dep.island_id');
        $builder->join('islands arr', 'r.arrival_island_id = arr.island_id');

        $builder->where('s.schedule_id', $scheduleId);

        return $builder->get()->getRowArray();
---
SELECT `s`.*, `b`.`boat_name`, `b`.`boat_type`, `b`.`capacity`, `b`.`price_per_trip`, `b`.`image_url`, `b`.`facilities`, `b`.`is_featured`, `r`.`route_id`, `r`.`estimated_duration`, `r`.`distance`, `dep`.`island_name` as `departure_island`, `arr`.`island_name` as `arrival_island`
FROM `schedules` `s`
JOIN `boats` `b` ON `s`.`boat_id` = `b`.`boat_id`
JOIN `routes` `r` ON `s`.`route_id` = `r`.`route_id`
JOIN `islands` `dep` ON `r`.`departure_island_id` = `dep`.`island_id`
JOIN `islands` `arr` ON `r`.`arrival_island_id` = `arr`.`island_id`
WHERE `s`.`schedule_id` = '33'