home/app/Models/TeamModel.php

SELECT *
FROM `teams`
WHERE `is_active` = 1
ORDER BY `display_order` ASC
---
    public function getActiveTeamMembers()
    {
        if (!$this->tableExists()) {
            return [];
        }

        return $this->where('is_active', 1)
                    ->orderBy('display_order', 'ASC')
                    ->findAll();