dashboard-dir/app/Controllers/Admin.php

    public function boats()
    {
        $boatModel = new \App\Models\BoatModel();
        $data = [
            'title' => 'Manage Boats',
            'boats' => $boatModel->findAll(),
---
SELECT *
FROM `boats`