dashboard-dir/app/Controllers/BlogController.php

SELECT *
FROM `blogs`
WHERE `blogs`.`blog_id` = '46'
---
    public function update($id)
    {
        $response = ['success' => false, 'message' => 'Failed to update blog'];

        $blog = $this->blogModel->find($id);

UPDATE `blogs` SET `title` = 'Fasilitas yang Ditawarkan Kapal Luxury', `slug` = 'fasilitas-yang-ditawarkan-kapal-luxury', `content` = 'Kapal luxury dilengkapi dengan berbagai fasilitas premium seperti AC, toilet bersih, catering, dan safety equipment lengkap.', `excerpt` = 'Nikmati kenyamanan maksimal dengan fasilitas lengkap yang ditawarkan kapal luxury.', `category_id` = '16', `status` = 'published', `published_at` = '2025-09-12 01:26:15', `featured_image` = 'uploads/blogs/original_1757640375_df39a76b5122caa26a2f.jpg', `thumbnail_image` = 'uploads/blogs/resized_1757640375_df39a76b5122caa26a2f.jpg', `updated_at` = '2025-09-12 01:26:15'
WHERE `blogs`.`blog_id` IN ('46')
---
            }
        }

        if ($this->blogModel->update($id, $data)) {