dashboard-dir/app/Controllers/FaqController.php

    public function index()
    {
        $data = [
            'title' => 'Manage FAQs',
            'faqs' => $this->faqModel->findAll(),
---
SELECT *
FROM `faqs`