dashboard-dir/app/Controllers/OpenTripController.php

SELECT *
FROM `request_open_trips`
WHERE `request_open_trips`.`request_id` = '11'
SELECT *
FROM `boats`
WHERE `boats`.`boat_id` = '13'
---
public function approveRequest($requestId)
{
    $request = $this->requestOpenTripModel->find($requestId);
    if (!$request) {
        return redirect()->back()->with('error', 'Request not found');
    }

    // Validasi agreed_price dan price_per_person
    $rules = [
        'agreed_price' => 'required|numeric|greater_than[0]',
        'price_per_person' => 'required|numeric|greater_than[0]'
    ];

    if (!$this->validate($rules)) {
        return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    $agreedPrice = $this->request->getPost('agreed_price');
    $pricePerPerson = $this->request->getPost('price_per_person');

    // Get boat capacity
    $boatId = $request['boat_id'];
    $boat = $this->boatModel->find($boatId);

INSERT INTO `schedules` (`route_id`, `boat_id`, `departure_date`, `departure_time`, `available_seats`, `is_open_trip`, `created_at`, `updated_at`) VALUES ('13', '13', '2025-08-30', '12:00:00', '8', 1, '2025-08-29 02:42:41', '2025-08-29 02:42:41')
---
        'is_open_trip' => 1
    ];

    $scheduleId = $this->scheduleModel->insert($scheduleData);

UPDATE `request_open_trips` SET `status` = 'approved', `updated_at` = '2025-08-29 02:42:41'
WHERE `request_open_trips`.`request_id` IN ('11')
---
    $openTripId = $this->openTripModel->insert($openTripData);

    // Update request status
    $this->requestOpenTripModel->update($requestId, ['status' => 'approved']);