dashboard-dir/app/Controllers/RouteController.php

SELECT *
FROM `islands`
---
    public function create()
    {
        $data = [
            'title' => 'Add New Route',
            'islands' => $this->islandModel->findAll(),